from typing import ItemsView


QC７つ道具
　特性要因図　結果である特性からそこまでの過程を図示かして問題点見つける
　管理図　時系列でグラフ見て管理限界線を越えたデータを異常値とする
　ふろーちゃーとか
　ヒストグラム　値の範囲（横軸）でグラフ作る
　パレード図　折れ線グラフと価の大きい順で左から棒グラフを示した図
　（ABC分析）Aクラス累積割合0.8 Bクラス　0.9 Cそれ以外
　ランチャーと　データの発生順に打点下折れ線グラフ
　散布図

ITサービスマネジメント　ITサービスとして品質を高める
ITIL　標準規格
RTO　目標復旧時間
RPO　目標復旧時点
ホットスタンバイ　予備のほうもシステム起動しとく
コールドスタンバイ　障害起きたら軌道
ウォームスタンバイ　OSだけ起動しすてむは障害起きてから起動
ローカルサービスデスク　物理的、仮想的にユーザーから近い窓口
バーチャルサービスデスク　IT用いて物理的に分散している拠点を１つと見せる
中央サービスデスク　１か所
ふぉろー、ざ、さん　２つ以上の異なる大陸上に置く、２４時間対応
ITガバナンス　情報システムの実行制御し、企業をあるべき方向へ導く
業務プロセス　目的を達成するための１連の流れ
BPR　ビジネスルールを見直し、職務再設計する
BPM　長期的にビジネスルール見直す
BPO　情報システム業務を外部委託する
オフショア　海外の企業に一部委託する
リエンジニアリング　ビジネスプロセスを見直し、コストを見直す
RPA　デスクワークをパソコン内のソフトウェアのロボットが自動化すること
BYOD　社員の私物のPCで業務に使う。なので企業は費用を削減できる
MtoM　機械と機械をつなぐ
ハウジングサービス　事業者にサーバーを預けるサービス
ホスティング（ホスト＝利用者がいっぱいいると呼ばれる）さービス　WEBサイトの公開に使われていて、複数のユーザーが利用するサーバーのこと
オンプレミス　自社の中でシステム保有し、自社内の設備によって運用すること
オンデマンド型サービス　利用者の要求でサービス提供
SOA　システムをサービスの集まりとして開発
DX（デジタルトランスフォーメーション）　データを用いてビジネスモデルを変革する
BI　自企業のビジネスにかかわる情報を社員が収集するためのツール


